# FabricAreaWrongLapSplice Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricFailures..::..FabricAreaWrongLapSplice Property
BuiltInFailures..::..FabricFailures Class See Also
---
Fabric Area Sheet lap splice is incorrect. Can't create Fabric Area.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabricAreaWrongLapSplice { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricAreaWrongLapSplice As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabricAreaWrongLapSplice {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FabricFailures Class
Autodesk.Revit.DB Namespace